---
title: DistributionSysType
classe: Autodesk.Revit.DB.Electrical.DistributionSysType
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# DistributionSysType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElectricalPhase ElectricalPhase { get; set; }` | `distributionSysType.ElectricalPhase` | ElectricalPhase |
| `ElectricalPhaseConfiguration ElectricalPhaseConfiguration { get; set; }` | `distributionSysType.ElectricalPhaseConfiguration` | ElectricalPhaseConfiguration |
| `ElectricalPhaseLine HighLegPhase { get; set; }` | `distributionSysType.HighLegPhase` | ElectricalPhaseLine |
| `Boolean IsInUse { get; }` | `distributionSysType.IsInUse` | Boolean |
| `Int32 NumWires { get; set; }` | `distributionSysType.NumWires` | Int32 |
| `VoltageType VoltageLineToGround { get; set; }` | `distributionSysType.VoltageLineToGround` | VoltageType |
| `VoltageType VoltageLineToLine { get; set; }` | `distributionSysType.VoltageLineToLine` | VoltageType |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```